# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 1s [id=/applications/c28691c7-9899-4e43-8292-86b99b0ed3d8]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 0s [id=/servicePrincipals/624533ce-2ca8-47a9-886d-6e667defc442]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.admin_app_reg will be created
  + resource "azuread_application" "admin_app_reg" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "dd-test-admin-app"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + web {
          + redirect_uris = [
              + "https://dd-test-admin-app.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_application_password.admin_app_secret will be created
  + resource "azuread_application_password" "admin_app_secret" {
      + application_id = (known after apply)
      + display_name   = "dd-test-admin-app"
      + end_date       = (known after apply)
      + id             = (known after apply)
      + key_id         = (known after apply)
      + start_date     = (known after apply)
      + value          = (sensitive value)
    }

  # azuread_service_principal.admin_app_sp will be created
  + resource "azuread_service_principal" "admin_app_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_linux_web_app.admin_app will be updated in-place
  ~ resource "azurerm_linux_web_app" "admin_app" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive value)
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~3"
          - "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"   = (sensitive value)
          - "WEBSITE_AUTH_AAD_ALLOWED_TENANTS"           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        } -> (known after apply)
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/dd-test-admin-app"
        name                                           = "dd-test-admin-app"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/dd-test-adminapp-ai"
            "solution"                                       = "apps"
        }
        # (25 unchanged attributes hidden)

      ~ auth_settings_v2 {
          ~ auth_enabled                            = false -> true
          + default_provider                        = "azureactivedirectory"
          ~ excluded_paths                          = [
              + "/health",
              + "/swagger",
            ]
          ~ unauthenticated_action                  = "Return403" -> "RedirectToLoginPage"
            # (8 unchanged attributes hidden)

          ~ active_directory_v2 {
              ~ allowed_applications                 = [
                  - "83327527-9010-4c48-84d9-5f1b99bba309",
                ]
              ~ allowed_audiences                    = [
                  - "api://83327527-9010-4c48-84d9-5f1b99bba309",
                ]
              ~ client_id                            = "83327527-9010-4c48-84d9-5f1b99bba309" -> (known after apply)
              ~ tenant_auth_endpoint                 = "https://sts.windows.net/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/v2.0/" -> "https://login.microsoftonline.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/v2.0/"
                # (8 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
                "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET",
              + "WEBSITE_AUTH_AAD_ALLOWED_TENANTS",
              + "APPINSIGHTS_INSTRUMENTATIONKEY",
              + "APPLICATIONINSIGHTS_CONNECTION_STRING",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-225-51"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.225.51"
      + id               = (known after apply)
      + name             = "admin-20-100-225-51"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.225.51"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-143"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.143"
      + id               = (known after apply)
      + name             = "admin-20-100-227-143"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.143"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-146"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.146"
      + id               = (known after apply)
      + name             = "admin-20-100-227-146"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.146"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-204"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.204"
      + id               = (known after apply)
      + name             = "admin-20-100-227-204"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.204"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-206"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.206"
      + id               = (known after apply)
      + name             = "admin-20-100-227-206"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.206"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-218"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.218"
      + id               = (known after apply)
      + name             = "admin-20-100-227-218"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.218"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-225"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.225"
      + id               = (known after apply)
      + name             = "admin-20-100-227-225"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.227.225"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-3-9"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.3.9"
      + id               = (known after apply)
      + name             = "admin-20-100-3-9"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.100.3.9"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-0-49"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.0.49"
      + id               = (known after apply)
      + name             = "admin-20-251-0-49"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.251.0.49"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-6-98"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.6.98"
      + id               = (known after apply)
      + name             = "admin-20-251-6-98"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.251.6.98"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-7-185"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.7.185"
      + id               = (known after apply)
      + name             = "admin-20-251-7-185"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.251.7.185"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-7-82"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.7.82"
      + id               = (known after apply)
      + name             = "admin-20-251-7-82"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.251.7.82"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-94-60"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.94.60"
      + id               = (known after apply)
      + name             = "admin-20-251-94-60"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-test-authz-pg"
      + start_ip_address = "20.251.94.60"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-225-51"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.225.51"
      + id               = (known after apply)
      + name             = "admin-20-100-225-51"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.225.51"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-143"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.143"
      + id               = (known after apply)
      + name             = "admin-20-100-227-143"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.143"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-146"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.146"
      + id               = (known after apply)
      + name             = "admin-20-100-227-146"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.146"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-204"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.204"
      + id               = (known after apply)
      + name             = "admin-20-100-227-204"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.204"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-206"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.206"
      + id               = (known after apply)
      + name             = "admin-20-100-227-206"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.206"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-218"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.218"
      + id               = (known after apply)
      + name             = "admin-20-100-227-218"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.218"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-225"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.225"
      + id               = (known after apply)
      + name             = "admin-20-100-227-225"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.227.225"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-3-9"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.3.9"
      + id               = (known after apply)
      + name             = "admin-20-100-3-9"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.100.3.9"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-0-49"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.0.49"
      + id               = (known after apply)
      + name             = "admin-20-251-0-49"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.251.0.49"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-6-98"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.6.98"
      + id               = (known after apply)
      + name             = "admin-20-251-6-98"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.251.6.98"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-7-185"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.7.185"
      + id               = (known after apply)
      + name             = "admin-20-251-7-185"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.251.7.185"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-7-82"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.7.82"
      + id               = (known after apply)
      + name             = "admin-20-251-7-82"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.251.7.82"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-94-60"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.94.60"
      + id               = (known after apply)
      + name             = "admin-20-251-94-60"
      + server_id        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-test-pg"
      + start_ip_address = "20.251.94.60"
    }

  # azurerm_servicebus_namespace.dd_sb_ns will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "dd_sb_ns" {
        id                                  = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.ServiceBus/namespaces/dd-test-sbn"
        name                                = "dd-test-sbn"
        tags                                = {
            "costcenter" = "altinn3"
            "solution"   = "apps"
        }
        # (13 unchanged attributes hidden)

      ~ network_rule_set {
          ~ ip_rules                      = [
              + "20.100.225.51",
              + "20.100.227.143",
              + "20.100.227.146",
              + "20.100.227.204",
              + "20.100.227.206",
              + "20.100.227.218",
              + "20.100.227.225",
              + "20.100.3.9",
              + "20.251.0.49",
              + "20.251.6.98",
              + "20.251.7.185",
              + "20.251.7.82",
              + "20.251.94.60",
                # (10 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-test-feedpoller-func"
        name                                           = "oed-test-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-feedpoller-ai"
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.testapp will be updated in-place
  ~ resource "azurerm_windows_web_app" "testapp" {
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-testapp-app"
        name                                           = "oed-testapp-app"
        tags                                           = {
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-testapp-ai"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
            # (29 unchanged attributes hidden)

          + virtual_application {
              + physical_path = "site\wwwroot"
              + preload       = false
              + virtual_path  = "/"
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 29 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `pull_request` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`